mtosi1.1-TestSuite/TestsDefinitions/MultiLayerSubNetWorkMgr/examples/MultiLayerSubnetworkMgr_getSNC.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ..\..\..\..\xsd\common\Header.xsd tmf854.v1 ..\..\..\..\xsd\interfaces\MultiLayerSubnetworkMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getSNC</activityName>
			<msgName>getSNC</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>SimpleResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getSNC tmf854Version="1.1">
			<sncName>
				<mdNm>Networks/XdrEMS/Server1</mdNm>
				<mlsnNm>19968</mlsnNm>
				<sncNm>629940228</sncNm>
			</sncName>
		</getSNC>
	</soap:Body>
</soap:Envelope>
